TexasInstruments/mcupsdk-core-k3/test/drivers/mcasp/mcasp/am62ax-sk/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Ax" --part "Default" --package "AMB" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM62A7-Q1" --package "FCBGA (AMB)" --variant "AM62A74-M" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.24.1+4189"}
 */

/**
 * Import the modules used in this configuration.
 */
const mcasp      = scripting.addModule("/drivers/mcasp/mcasp", {}, false);
const mcasp1     = mcasp.addInstance();
const mcasp2     = mcasp.addInstance();
const mcasp3     = mcasp.addInstance();
const clock      = scripting.addModule("/kernel/dpl/clock");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();
const mpu_armv76 = mpu_armv7.addInstance();
const mpu_armv77 = mpu_armv7.addInstance();
const mpu_armv78 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
mcasp1.$name                                   = "CONFIG_MCASP0";
mcasp1.txDataMask                              = 0xFFFFFFFF;
mcasp1.txActiveSlotMask                        = 0x3;
mcasp1.rxDataMask                              = 0xFFFFFFFF;
mcasp1.rxActiveSlotMask                        = 0x3;
mcasp1.txLoopjobBufLength                      = 1280;
mcasp1.rxLoopjobBufLength                      = 1280;
mcasp1.txCallbackFxn                           = "mcasp_txcb";
mcasp1.rxCallbackFxn                           = "mcasp_rxcb";
mcasp1.txClkApplyAlert                         = false;
mcasp1.rxClkApplyAlert                         = false;
mcasp1.MCASP.$assignAllowConflicts             = "MCASP0";
mcasp1.SYSTEM.$assignAllowConflicts            = "SYSTEM0";
mcasp1.mcaspSer.create(2);
mcasp1.mcaspSer[0].$name                       = "CONFIG_MCASP_SER0";
mcasp1.mcaspSer[0].MCASP.$assignAllowConflicts = "MCASP0";
mcasp1.mcaspSer[1].$name                       = "CONFIG_MCASP_SER1";
mcasp1.mcaspSer[1].serNum                      = 1;
mcasp1.mcaspSer[1].dataDir                     = "Receive";
mcasp1.mcaspSer[1].MCASP.$assignAllowConflicts = "MCASP0";
scripting.suppress("Resource conflict,MCASP0 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.MCASP, "$assign");
scripting.suppress("Resource conflict,SYSTEM0 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.SYSTEM, "$assign");
scripting.suppress("Resource conflict,MCASP0 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.mcaspSer[0].MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP0 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.mcaspSer[1].MCASP, "$assign");

mcasp2.$name                                   = "CONFIG_MCASP1";
mcasp2.txDataMask                              = 0xFFFFFFFF;
mcasp2.txActiveSlotMask                        = 0x3;
mcasp2.rxDataMask                              = 0xFFFFFFFF;
mcasp2.rxActiveSlotMask                        = 0x3;
mcasp2.txLoopjobBufLength                      = 1280;
mcasp2.rxLoopjobBufLength                      = 1280;
mcasp2.txCallbackFxn                           = "mcasp_txcb";
mcasp2.rxCallbackFxn                           = "mcasp_rxcb";
mcasp2.txLoopjobBuf                            = "gTxLoopjobBuf1";
mcasp2.rxLoopjobBuf                            = "gRxLoopjobBuf1";
mcasp2.txHclkSource                            = 0;
mcasp2.txHclkSourceMux                         = 1;
mcasp2.rxHclkSource                            = 0;
mcasp2.rxHclkSourceMux                         = 1;
mcasp2.txHclkExpected                          = 24576000;
mcasp2.txBclkCalculated                        = 3072000;
mcasp2.txFsyncCalculated                       = 48000;
mcasp2.txClkApplyAlert                         = false;
mcasp2.rxHclkExpected                          = 24576000;
mcasp2.rxBclkCalculated                        = 3072000;
mcasp2.rxFsyncCalculated                       = 48000;
mcasp2.rxClkApplyAlert                         = false;
mcasp2.MCASP.$assignAllowConflicts             = "MCASP1";
mcasp2.mcaspSer.create(2);
mcasp2.mcaspSer[0].$name                       = "CONFIG_MCASP_SER2";
mcasp2.mcaspSer[0].MCASP.$assignAllowConflicts = "MCASP1";
mcasp2.mcaspSer[1].$name                       = "CONFIG_MCASP_SER3";
mcasp2.mcaspSer[1].serNum                      = 1;
mcasp2.mcaspSer[1].dataDir                     = "Receive";
mcasp2.mcaspSer[1].MCASP.$assignAllowConflicts = "MCASP1";
mcasp2.SYSTEM.$assignAllowConflicts            = "SYSTEM0";
mcasp2.SYSTEM.CLKOUT0.$assignAllowConflicts    = "EXT_REFCLK1";
scripting.suppress("Resource conflict,MCASP1 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp2.MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP1 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp2.mcaspSer[0].MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP1 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp2.mcaspSer[1].MCASP, "$assign");
scripting.suppress("Resource conflict,SYSTEM0 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp2.SYSTEM, "$assign");
scripting.suppress("Resource conflict,@@@.+?@@@ is also in use by @@@.+?@@@", mcasp2.SYSTEM, "CLKOUT0");

mcasp3.$name                                   = "CONFIG_MCASP2";
mcasp3.txDataMask                              = 0xFFFFFFFF;
mcasp3.txActiveSlotMask                        = 0x3;
mcasp3.rxDataMask                              = 0xFFFFFFFF;
mcasp3.rxActiveSlotMask                        = 0x3;
mcasp3.txLoopjobBufLength                      = 1280;
mcasp3.rxLoopjobBufLength                      = 1280;
mcasp3.txCallbackFxn                           = "mcasp_txcb";
mcasp3.rxCallbackFxn                           = "mcasp_rxcb";
mcasp3.txLoopjobBuf                            = "gTxLoopjobBuf2";
mcasp3.rxLoopjobBuf                            = "gRxLoopjobBuf2";
mcasp3.txHclkSource                            = 0;
mcasp3.txHclkSourceMux                         = 1;
mcasp3.rxHclkSource                            = 0;
mcasp3.rxHclkSourceMux                         = 1;
mcasp3.txHclkExpected                          = 24576000;
mcasp3.txBclkCalculated                        = 3072000;
mcasp3.txFsyncCalculated                       = 48000;
mcasp3.txClkApplyAlert                         = false;
mcasp3.rxHclkExpected                          = 24576000;
mcasp3.rxBclkCalculated                        = 3072000;
mcasp3.rxFsyncCalculated                       = 48000;
mcasp3.rxClkApplyAlert                         = false;
mcasp3.MCASP.$assignAllowConflicts             = "MCASP2";
mcasp3.mcaspSer.create(2);
mcasp3.mcaspSer[0].$name                       = "CONFIG_MCASP_SER4";
mcasp3.mcaspSer[0].MCASP.$assignAllowConflicts = "MCASP2";
mcasp3.mcaspSer[1].$name                       = "CONFIG_MCASP_SER5";
mcasp3.mcaspSer[1].serNum                      = 1;
mcasp3.mcaspSer[1].dataDir                     = "Receive";
mcasp3.mcaspSer[1].MCASP.$assignAllowConflicts = "MCASP2";
mcasp3.SYSTEM.$assignAllowConflicts            = "SYSTEM0";
mcasp3.SYSTEM.CLKOUT0.$assignAllowConflicts    = "EXT_REFCLK1";
scripting.suppress("Resource conflict,MCASP2 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp3.MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP2 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp3.mcaspSer[0].MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP2 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp3.mcaspSer[1].MCASP, "$assign");
scripting.suppress("Resource conflict,SYSTEM0 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp3.SYSTEM, "$assign");
scripting.suppress("Resource conflict,@@@.+?@@@ is also in use by @@@.+?@@@", mcasp3.SYSTEM, "CLKOUT0");

const udma         = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1        = udma.addInstance({}, false);
udma1.$name        = "CONFIG_UDMA0";
mcasp1.bcDmaDriver = udma1;
mcasp2.bcDmaDriver = udma1;
mcasp3.bcDmaDriver = udma1;

debug_log.enableUartLog      = true;
debug_log.uartTrace          = true;
debug_log.enableLogZoneError = false;
debug_log.uartLog.$name      = "CONFIG_UART0";

mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.$name             = "REGISTER_REGION";

mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv72.size              = 7;
mpu_armv72.$name             = "TCMA_VEC";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv73.baseAddr          = 0x41C00000;
mpu_armv73.size              = 19;

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 16;

mpu_armv75.$name    = "DDR";
mpu_armv75.baseAddr = 0x90000000;
mpu_armv75.size     = 28;

mpu_armv76.baseAddr   = 0x41010000;
mpu_armv76.size       = 15;
mpu_armv76.attributes = "NonCached";
mpu_armv76.$name      = "TCMB";

mpu_armv77.size       = 15;
mpu_armv77.attributes = "NonCached";
mpu_armv77.$name      = "TCMA";

mpu_armv78.baseAddr = 0x43C00000;
mpu_armv78.size     = 18;
mpu_armv78.$name    = "HSM_RAM";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
mcasp1.MCASP.AFSX.$suggestSolution               = "MCASP0_AFSX";
mcasp1.MCASP.ACLKX.$suggestSolution              = "MCASP0_ACLKX";
mcasp1.MCASP.AFSR.$suggestSolution               = "MCASP0_AFSR";
mcasp1.MCASP.ACLKR.$suggestSolution              = "MCASP0_ACLKR";
mcasp1.mcaspSer[0].MCASP.AXR0.$suggestSolution   = "MCASP0_AXR0";
mcasp1.mcaspSer[1].MCASP.AXR1.$suggestSolution   = "MCASP0_AXR1";
mcasp2.MCASP.AFSX.$suggestSolution               = "GPMC0_WAIT0";
mcasp2.MCASP.ACLKX.$suggestSolution              = "GPMC0_BE0n_CLE";
mcasp2.MCASP.AFSR.$suggestSolution               = "GPMC0_CSn2";
mcasp2.MCASP.ACLKR.$suggestSolution              = "GPMC0_CSn3";
mcasp2.mcaspSer[0].MCASP.AXR0.$suggestSolution   = "GPMC0_WEn";
mcasp2.mcaspSer[1].MCASP.AXR1.$suggestSolution   = "GPMC0_OEn_REn";
mcasp3.MCASP.AFSX.$suggestSolution               = "GPMC0_AD12";
mcasp3.MCASP.ACLKX.$suggestSolution              = "GPMC0_AD13";
mcasp3.MCASP.AFSR.$suggestSolution               = "GPMC0_AD14";
mcasp3.MCASP.ACLKR.$suggestSolution              = "GPMC0_AD15";
mcasp3.mcaspSer[0].MCASP.AXR0.$suggestSolution   = "GPMC0_AD8";
mcasp3.mcaspSer[1].MCASP.AXR1.$suggestSolution   = "GPMC0_AD9";
debug_log.uartLog.WKUP_UART.$suggestSolution     = "WKUP_USART0";
debug_log.uartLog.WKUP_UART.RXD.$suggestSolution = "WKUP_UART0_RXD";
debug_log.uartLog.WKUP_UART.TXD.$suggestSolution = "WKUP_UART0_TXD";
